#!/usr/bin/env python
# -*- coding: utf-8 -*-

import requests
from bs4 import BeautifulSoup
import json
import xmltodict

'''
# URL 설정
url = "https://service.epost.go.kr/trace.RetrieveDomRigiTraceList.comm?sid1=1102326109991&displayHeader="

# 웹 페이지 가져오기
response = requests.get(url)
soup = BeautifulSoup(response.text, 'html.parser')

# 테이블 찾기
table = soup.find('table', {'id': 'processTable'})



# 마지막 행 찾기
last_row = table.find_all('tr')[-1]
columns = last_row.find_all('td')

# 각 열의 값을 변수에 담기
column_values = [col.text.strip() for col in columns]

# 변수에 담기
var1, var2, var3, var4 = column_values  # 필요한 변수 개수에 맞게 조정

#print(f"Var1: {var1}, Var2: {var2}, Var3: {var3}, Var4: {var4}")
msg = var4.replace('\n','').replace(' ','').replace('\t','')

print(msg)
'''
#####################################################################
#공공데이터포털

request_list = []

#u8QPHpkZe9C7B9v%2Fgjvh3VQNgqs%2BgvHCKdy7v4Oa0wWMtXL10EMG9Y634m0FckWe13ts7riEn5qJpD%2FXLQeyRg%3D%3D
#u8QPHpkZe9C7B9v/gjvh3VQNgqs+gvHCKdy7v4Oa0wWMtXL10EMG9Y634m0FckWe13ts7riEn5qJpD/XLQeyRg==

import requests

rgist_list = ['1102326109942',
'1102326109943',
'1102326109944',
'1102326109945',
'1102326109946',
'1102326109947',
'1102326109948',
'1102326109949',
'1102326109950',
'1102326109951',
'1102326109952',
'1102326109953',
'1102326109954',
'1102326109955',
'1102326109956',
'1102326109957',
'1102326109958',
'1102326109959',
'1102326109960',
'1102326109961',
'1102326109962',
'1102326109963',
'1102326109964',
'1102326109965',
'1102326109966',
'1102326109967',
'1102326109968',
'1102326109969',
'1102326109970',
'1102326109971',
'1102326109972',
'1102326109973',
'1102326109974',
'1102326109975',
'1102326109976',
'1102326109977',
'1102326109978',
'1102326109979',
'1102326109980',
'1102326109981',
'1102326109982',
'1102326109983',
'1102326109984',
'1102326109985',
'1102326109986',
'1102326109987',
'1102326109988',
'1102326109989',
'1102326109990',
'1102326109991',
'1102326109992',
'1102326109993',
'1102326109994',
'1102326109995',
'1102326109996',
'1102326109997',
'1102326109998',
'1102326109999',
'1102326110000',
'1102326110001',
'1102326110002',
'1102326110003',
'1102326110004',
'1102326110005',
'1102326110006',
'1102326110007',
'1102326110008',
'1102326110009',
'1102326110010',
'1102326110011',
'1102326110012',
'1102326110013',
'1102326110014',
'1102326110015',
'1102326110016',
'1102326110017',
'1102326110018',
'1102326110019',
'1102326110020',
'1102326110021',
'1102326110022',
'1102326110023',
'1102326110024',
'1102326110025',
'1102326110026',
'1102326110027',
'1102326110028',
'1102326110029',
'1102326110030',
'1102326110031',
'1102326110032',
'1102326110033',
'1102326110034',
'1102326110035',
'1102326110036',
'1102326110037',
'1102326110038',
'1102326110039',
'1102326110040',
'1102326110041',
'1102326110042',
'1102326110043',
'1102326110044',
'1102326110045',
'1102326110046',
'1102326110047',
'1102326110048',
'1102326110049',
'1102326110050',
'1102326110051',
'1102326110052',
'1102326110053',
'1102326110054',
'1102326110055',
'1102326110056',
'1102326110057',
'1102326110058',
'1102326110059',
'1102326110060',
'1102326110061',
'1102326110062',
'1102326110063',
'1102326110064',
'1102326110065',
'1102326110066',
'1102326110067',
'1102326110068',
'1102326110069',
'1102326110070',
'1102326110071',
'1102326110072',
'1102326110073',
'1102326110074',
'1102326110075',
'1102326110076',
'1102326110077',
'1102326110078',
'1102326110079',
'1102326110080',
'1102326110081',
'1102326110082',
'1102326110083',
'1102326110084',
'1102326110085',
'1102326110086',
'1102326110087',
'1102326110088',
'1102326110089',
'1102326110090',
'1102326110091',
'1102326110092',
'1102326110093',
'1102326110094',
'1102326110095',
'1102326110096',
'1102326110097',
'1102326110098',
'1102326110099',
'1102326110100',
'1102326110101',
'1102326110102',
'1102326110103',
'1102326110104',
'1102326110105',
'1102326110106',
'1102326110107',
'1102326110108',
'1102326110109',
'1102326110110',
'1102326110111',
'1102326110112',
'1102326110113',
'1102326110114',
'1102326110115',
'1102326110116',
'1102326110117']

def get_status(rgist):
    url = 'http://openapi.epost.go.kr/trace/retrieveLongitudinalCombinedService/retrieveLongitudinalCombinedService/getLongitudinalCombinedList'
    params ={'serviceKey' : 'u8QPHpkZe9C7B9v/gjvh3VQNgqs+gvHCKdy7v4Oa0wWMtXL10EMG9Y634m0FckWe13ts7riEn5qJpD/XLQeyRg==', 'rgist' : rgist }

    response = requests.get(url, params=params)
    #print(response.text)
    f = response.content#.decode(encoding='UTF-8', errors="Strict")
    #f.decode(encoding='UTF-8', errors='strict')


    dict_type = xmltodict.parse(f)
    #print(dict_type)
    json_type = json.dumps(dict_type)
    dict2_type = json.loads(json_type)

    #print(dict_type['response']['trackInfo'])
    #print(dict_type['response']['trackInfo']['detaileTrackList'])
    header = dict_type['response']['trackInfo']
    TrackList = dict_type['response']['trackInfo']['detaileTrackList']

    #print(header)
    #print(TrackList)

    for T in TrackList:

        if T['statue'] == ('배달완료 ( 배달 )'):
            #print("print(T):", T)
            tt = T

        if ('반송배달' not in T['statue'] and '배달준비' not in T['statue'] and '접수' not in T['statue'] and '발송' not in T['statue'] and '도착' not in T['statue']):
            #print("eree",T)
            tt = T
    tt.setdefault('송장번호', rgist)
    #print("최종결과 : ",tt)



    return tt

    #request_list.append(tt)

    #print(request_list)


i = 0
for R in rgist_list:
    #print(R)
    Recu = get_status(R)
    #print((Recu.get('송장번호'), Recu.get('date'), Recu.get('time'), Recu.get('location'), Recu.get('statue')))
    get_list = [Recu.get('송장번호'), Recu.get('date'), Recu.get('time'), Recu.get('location'), Recu.get('statue').replace('\n',' ')]

    get_text = "|".join(get_list)

    request_list.append(get_text)
    i +=1

print(request_list)


#request_list = ['1102326109942|2024-09-05|10:26|울산우체국|미배달  이사불명\n(반송)', '1102326109943|2024-09-05|13:30|고양일산우체국|미배달  수취인불명\n(반송)', '1102326109944|2024-09-06|10:34|김해우체국|미배달  폐문부재\n(보관중)', '1102326109945|2024-09-06|12:05|동울산우체국|배달완료 (배달)\n (수령인:수**님 - 무인배달)', '1102326109946|2024-09-04|11:04|고령우체국|배달완료 (배달)\n (수령인:이**님 - 회사동료)', '1102326109947|2024-09-05|10:52|제주우편집중국|미배달  수취인불명\n(반송)', '1102326109948|2024-09-05|11:35|부산금정우체국|배달완료 (배달)\n (수령인:황**님 - 회사동료)', '1102326109949|2024-09-06|11:21|동래우체국|배달완료 (배달)\n (수령인:오**님 - 경비원)', '1102326109950|2024-09-06|10:45|진주우체국|미배달  폐문부재\n(보관중)', '1102326109951|2024-09-06|09:30|용인우체국|미배달  수취인불명\n(반송)', '1102326109952|2024-09-05|09:07|고양덕양우체국|미배달  수취인불명\n(반송)', '1102326109953|2024-09-05|12:14|성남우체국|배달완료 (배달)\n (수령인:이**님 - 본인)', '1102326109954|2024-09-05|14:41|예천우체국|배달완료 (배달)\n (수령인:김**님 - 배우자)', '1102326109955|2024-09-05|12:27|대구달서우체국|미배달  이사불명\n(반송)', '1102326109956|2024-09-05|11:01|안동우체국|미배달  이사불명\n(반송)', '1102326109957|2024-09-06|10:20|천안우체국|미배달  폐문부재\n(보관중)', '1102326109958|2024-09-05|13:24|김포우체국|미배달  주소불명\n(반송)', '1102326109959|2024-09-05|10:22|화성동탄우체국|미배달  수취인불명\n(반송)', '1102326109960|2024-09-06|11:01|시흥우체국|미배달  폐문부재\n(보관중)', '1102326109961|2024-09-06|12:15|서울양천우체국|배달완료 (배달)\n (수령인:박**님 - 본인)', '1102326109962|2024-09-06|10:02|서울중랑우체국|미배달  폐문부재\n(보관중)', '1102326109963|2024-09-05|13:08|부산사상우체국|배달완료 (배달)\n (수령인:이**님 - 경비원)', '1102326109964|2024-09-05|13:08|평택우체국|미배달  수취인불명\n(반송)', '1102326109965|2024-09-05|14:22|평택우체국|배달완료 (배달)\n (수령인:박**님 - 자녀)', '1102326109966|2024-09-05|12:23|횡성우체국|미배달  폐문부재\n(보관중)', '1102326109967|2024-09-05|11:54|서울강동우체국|미배달  수취인불명\n(반송)', '1102326109968|2024-09-05|11:44|서울강남우체국|미배달  수취인불명\n(반송)', '1102326109969|2024-09-05|13:03|광주광산우체국|미배달  이사불명\n(반송)', '1102326109970|2024-09-06|10:54|구미우체국|미배달  폐문부재\n(보관중)', '1102326109971|2024-09-05|09:46|양주우체국|배달완료 (배달)\n (수령인:윤**님 - 자녀)', '1102326109972|2024-09-06|10:58|서울양천우체국|미배달  폐문부재\n(보관중)', '1102326109973|2024-09-05|11:45|서울송파우체국|미배달  수취인불명\n(반송)', '1102326109974|2024-09-05|10:33|수원우체국|미배달  수취인불명\n(반송)', '1102326109975|2024-09-06|12:36|전주우체국|미배달  폐문부재\n(보관중)', '1102326109976|2024-09-06|09:59|인천남동우체국|배달완료 (배달)\n (수령인:이**님 - 본인)', '1102326109977|2024-09-05|12:23|의정부우체국|배달완료 (배달)\n (수령인:홍**님 - 경비원)', '1102326109978|2024-09-05|11:47|횡성우체국|미배달  폐문부재\n(보관중)', '1102326109979|2024-09-05|13:05|울산우체국|배달완료 (배달)\n (수령인:배**님 - 본인)', '1102326109980|2024-09-05|12:20|포천일동우체국|배달완료 (배달)\n (수령인:성**님 - 본인)', '1102326109981|2024-09-06|08:18|성남우체국|배달완료 (배달)\n (수령인:성**님 - 본인)', '1102326109982|2024-09-05|11:53|제주우편집중국|미배달  수취인불명\n(반송)', '1102326109983|2024-09-06|11:22|서울영등포우체국|미배달  폐문부재\n(보관중)', '1102326109984|2024-09-04|12:46|구리우체국|배달완료 (배달)\n (수령인:장**님 - 배우자)', '1102326109985|2024-09-05|10:34|용인우체국|배달완료 (배달)\n (수령인:오**님 - 경비원)', '1102326109986|2024-09-06|13:12|서울양천우체국|미배달  폐문부재\n(보관중)', '1102326109987|2024-09-05|12:53|부산진우체국|배달완료 (배달)\n (수령인:이**님 - 부모)', '1102326109988|2024-09-06|11:53|군포우체국|미배달  폐문부재\n(보관중)', '1102326109989|2024-09-06|10:19|김포우체국|미배달  폐문부재\n(보관중)', '1102326109990|2024-09-05|09:49|대전우체국|미배달  주소불명\n(반송)', '1102326109991|2024-09-05|10:26|울산우체국|미배달  이사불명\n(반송)', '1102326109992|2024-09-04|10:31|대전둔산우체국|미배달  수취인불명\n(반송)', '1102326109993|2024-09-06|13:35|동래우체국|미배달  폐문부재\n(보관중)', '1102326109994|2024-09-05|13:10|계룡금암동우체국|미배달  폐문부재\n(보관중)', '1102326109995|2024-09-05|09:54|천안우체국|미배달  수취인불명\n(반송)', '1102326109996|2024-09-06|14:12|서울영등포우체국|미배달  폐문부재\n(보관중)', '1102326109997|2024-09-05|09:31|당진우체국|미배달  폐문부재\n(보관중)', '1102326109998|2024-09-05|11:30|양산우체국|미배달  폐문부재\n(보관중)', '1102326109999|2024-09-06|09:22|부천우체국|미배달  수취인불명\n(반송)', '1102326110000|2024-09-06|11:19|남인천우체국|배달완료 (배달)\n (수령인:보**님 - 무인배달)', '1102326110001|2024-09-06|12:06|서울서초우체국|미배달  폐문부재\n(보관중)', '1102326110002|2024-09-05|13:39|광양우체국|미배달  폐문부재\n(보관중)', '1102326110003|2024-09-05|10:15|울산우체국|배달완료 (배달)\n (수령인:이**님 - 경비원)', '1102326110004|2024-09-04|12:10|오창과학단지우체국|미배달  이사불명\n(반송)', '1102326110005|2024-09-05|14:14|영주우체국|배달완료 (배달)\n (수령인:김**님 - 배우자)', '1102326110006|2024-09-06|12:17|서울영등포우체국|배달완료 (배달)\n (수령인:우**님 - 무인배달)', '1102326110007|2024-09-09|12:04|부산진우체국|배달완료 (배달)\n (수령인:박**님 - 본인)', '1102326110008|2024-09-06|13:36|부평우체국|미배달  폐문부재\n(보관중)', '1102326110009|2024-09-05|08:52|성남분당우체국|배달완료 (배달)\n (수령인:김**님 - 경비원)', '1102326110010|2024-09-06|13:47|진천우체국|배달완료 (배달)\n (수령인:정**님 - 본인)', '1102326110011|2024-09-06|09:42|안산우체국|배달완료 (배달)\n (수령인:이**님 - 본인)', '1102326110012|2024-09-05|11:38|서울강동우체국|배달완료 (배달)\n (수령인:이**님 - 배우자)', '1102326110013|2024-09-04|11:01|대전둔산우체국|배달완료 (배달)\n (수령인:윤*님 - 자녀)', '1102326110014|2024-09-06|13:11|서울강동우체국|미배달  폐문부재\n(보관중)', '1102326110015|2024-09-06|15:14|군산우체국|미배달  폐문부재\n(보관중)', '1102326110016|2024-09-05|10:06|서울송파우체국|미배달  수취인불명\n(반송)', '1102326110017|2024-09-06|12:19|서광주우체국|배달완료 (배달)\n (수령인:조**님 - 본인)', '1102326110018|2024-09-05|12:12|군포우체국|배달완료 (배달)\n (수령인:김**님 - 본인)', '1102326110019|2024-09-05|13:21|광주우체국|미배달  수취인불명\n(반송)', '1102326110020|2024-09-06|13:08|대구성서우체국|미배달  폐문부재\n(보관중)', '1102326110021|2024-09-05|11:49|진접우체국|미배달  폐문부재\n(보관중)', '1102326110022|2024-09-06|11:08|성남우체국|미배달  폐문부재\n(보관중)', '1102326110023|2024-09-09|05:59|북광주우체국|미배달  폐문부재\n(보관중)', '1102326110024|2024-09-05|11:27|부산강서우체국|미배달  폐문부재\n(보관중)', '1102326110025|2024-09-05|11:47|여수우체국|배달완료 (배달)\n (수령인:이**님 - 회사동료)', '1102326110026|2024-09-05|09:17|서수원우체국|배달완료 (배달)\n (수령인:박**님 - 본인)', '1102326110027|2024-09-04|11:12|전곡우체국|미배달  폐문부재\n(보관중)', '1102326110028|2024-09-05|14:01|전주우체국|배달완료 (배달)\n (수령인:양**님 - 본인)', '1102326110029|2024-09-05|11:42|동래우체국|배달완료 (배달)\n (수령인:김**님 - 본인)', '1102326110030|2024-09-06|10:20|부평우체국|미배달  폐문부재\n(보관중)', '1102326110031|2024-09-05|09:17|서울도봉우체국|미배달  이사불명\n(반송)', '1102326110032|2024-09-06|13:54|고양일산우체국|미배달  수취인불명\n(반송)', '1102326110033|2024-09-06|13:03|춘천우체국|미배달  폐문부재\n(보관중)', '1102326110034|2024-09-05|10:55|대관령우체국|미배달  폐문부재\n(보관중)', '1102326110035|2024-09-06|13:44|동래우체국|미배달  폐문부재\n(보관중)', '1102326110036|2024-09-06|09:35|안산우체국|미배달  수취인불명\n(반송)', '1102326110037|2024-09-06|12:20|서울성북우체국|미배달  수취인부재\n(보관중)', '1102326110038|2024-09-05|12:14|인천중동우체국|미배달  폐문부재\n(보관중)', '1102326110039|2024-09-05|10:54|부산좌1동우체국|미배달  폐문부재\n(보관중)', '1102326110040|2024-09-04|11:47|서울강서우체국|배달완료 (배달)\n (수령인:조**님 - 자녀)', '1102326110041|2024-09-06|13:00|수원우체국|배달완료 (배달)\n (수령인:김**님 - 자녀)', '1102326110042|2024-09-06|12:39|서울서초우체국|미배달  폐문부재\n(보관중)', '1102326110043|2024-09-06|11:34|고양일산우체국|미배달  폐문부재\n(보관중)', '1102326110044|2024-09-09|10:54|서울서초우체국|배달완료 (배달)\n (수령인:최**님 - 본인)', '1102326110045|2024-09-09|15:49|광주우체국|배달완료 (배달)\n (수령인:김**님 - 본인)', '1102326110046|2024-09-05|11:00|부산진우체국|배달완료 (배달)\n (수령인:이**님 - 본인)', '1102326110047|2024-09-05|09:50|성남분당우체국|미배달  수취인불명\n(반송)', '1102326110048|2024-09-06|12:14|평택우체국|미배달  폐문부재\n(보관중)', '1102326110049|2024-09-05|10:14|울산우체국|배달완료 (배달)\n (수령인:김**님 - 본인)', '1102326110050|2024-09-06|16:35|강릉우체국|배달완료 (배달)\n (수령인:최**님 - 배우자)', '1102326110051|2024-09-05|10:19|해운대우체국|배달완료 (배달)\n (수령인:박**님 - 본인)', '1102326110052|2024-09-05|09:36|광화문우체국|미배달  수취인불명\n(반송)', '1102326110053|2024-09-04|09:54|충주우체국|배달완료 (배달)\n (수령인:이**님 - 배우자)', '1102326110054|2024-09-05|14:02|평창우체국|미배달  폐문부재\n(보관중)', '1102326110055|2024-09-05|11:00|서귀포우체국|배달완료 (배달)\n (수령인:장**님 - 회사동료)', '1102326110056|2024-09-05|12:04|서인천우체국|미배달  폐문부재\n(보관중)', '1102326110057|2024-09-06|10:19|김포우체국|미배달  폐문부재\n(보관중)', '1102326110058|2024-09-05|12:31|창원우체국|미배달  수취인불명\n(반송)', '1102326110059|2024-09-05|08:44|오산우체국|미배달  폐문부재\n(보관중)', '1102326110060|2024-09-05|12:50|울산우체국|미배달  수취인불명\n(반송)', '1102326110061|2024-09-05|12:36|서광주우체국|미배달  수취인불명\n(반송)', '1102326110062|2024-09-06|12:46|서울강남우체국|미배달  수취인불명\n(반송)', '1102326110063|2024-09-04|09:55|부안우체국|미배달  폐문부재\n(보관중)', '1102326110064|2024-09-05|11:25|남울산우체국|배달완료 (배달)\n (수령인:이**님 - 경비원)', '1102326110065|2024-09-05|09:32|북광주우체국|배달완료 (배달)\n (수령인:김**님 - 회사동료)', '1102326110066|2024-09-04|15:31|서울광진우체국|미배달  수취인불명\n(반송)', '1102326110067|2024-09-06|11:31|서울송파우체국|미배달  폐문부재\n(보관중)', '1102326110068|2024-09-06|09:33|서울동작우체국|미배달  폐문부재\n(보관중)', '1102326110069|2024-09-05|09:14|진접우체국|미배달  수취인불명\n(반송)', '1102326110070|2024-09-06|09:46|서수원우체국|미배달  폐문부재\n(보관중)', '1102326110071|2024-09-06|11:43|서울서초우체국|미배달  수취인불명\n(반송)', '1102326110072|2024-09-05|12:14|하귀우체국|미배달  주소불명\n(반송)', '1102326110073|2024-09-06|09:44|용인우체국|배달완료 (배달)\n (수령인:김**님 - 본인)', '1102326110074|2024-09-06|11:09|동두천우체국|미배달  폐문부재\n(보관중)', '1102326110075|2024-09-05|09:58|나주우체국|배달완료 (배달)\n (수령인:이**님 - 본인)', '1102326110076|2024-09-09|15:16|북대구우체국|배달완료 (배달)\n (수령인:이**님 - 본인)', '1102326110077|2024-09-05|11:30|고양덕양우체국|미배달  수취인불명\n(반송)', '1102326110078|2024-09-06|10:10|서울도봉우체국|미배달  폐문부재\n(보관중)', '1102326110079|2024-09-09|14:01|하남우체국|미배달  폐문부재\n(보관중)', '1102326110080|2024-09-04|11:34|영천우체국|배달완료 (배달)\n (수령인:김**님 - 회사동료)', '1102326110081|2024-09-06|10:41|양주우체국|미배달  폐문부재\n(보관중)', '1102326110082|2024-09-06|12:05|서울관악우체국|미배달  폐문부재\n(보관중)', '1102326110083|2024-09-06|10:53|서광주우체국|미배달  폐문부재\n(보관중)', '1102326110084|2024-09-05|11:46|서울용산우체국|배달완료 (배달)\n (수령인:홍**님 - 본인)', '1102326110085|2024-09-09|18:00|서울강서우체국|미배달  기타(보관기간경과)\n(반송)', '1102326110086|2024-09-06|11:05|서수원우체국|미배달  폐문부재\n(보관중)', '1102326110087|2024-09-05|13:55|서울노원우체국|배달완료 (배달)\n (수령인:황**님 - 배우자)', '1102326110088|2024-09-04|12:33|군위의흥우체국|미배달  폐문부재\n(보관중)', '1102326110089|2024-09-05|08:42|세종우체국|미배달  폐문부재\n(보관중)', '1102326110090|2024-09-06|10:46|동수원우체국|배달완료 (배달)\n (수령인:정**님 - 본인)', '1102326110091|2024-09-06|11:43|의정부우체국|미배달  폐문부재\n(보관중)', '1102326110092|2024-09-06|11:05|강릉우체국|미배달  폐문부재\n(보관중)', '1102326110093|2024-09-05|11:54|인천우체국|미배달  수취인불명\n(반송)', '1102326110094|2024-09-05|12:15|성남우체국|미배달  수취인불명\n(반송)', '1102326110095|2024-09-05|11:57|서울서초우체국|배달완료 (배달)\n (수령인:신**님 - 회사동료)', '1102326110096|2024-09-09|09:34|대전유성우체국|배달완료 (배달)\n (수령인:이**님 - 본인)', '1102326110097|2024-09-04|11:05|상주공성우체국|미배달  수취인부재\n(보관중)', '1102326110098|2024-09-05|13:07|해운대우체국|배달완료 (배달)\n (수령인:경**님 - 무인배달)', '1102326110099|2024-09-05|12:13|서울서초우체국|미배달  수취인불명\n(반송)', '1102326110100|2024-09-05|11:55|서울양천우체국|배달완료 (배달)\n (수령인:권**님 - 자녀)', '1102326110101|2024-09-09|10:28|동해우체국|배달완료 (배달)\n (수령인:유**님 - 배우자)', '1102326110102|2024-09-05|09:58|서광주우체국|배달완료 (배달)\n (수령인:김**님 - 배우자)', '1102326110103|2024-09-06|11:01|남인천우체국|미배달  폐문부재\n(보관중)', '1102326110104|2024-09-05|10:25|서울중랑우체국|배달완료 (배달)\n (수령인:김**님 - 본인)', '1102326110105|2024-09-05|09:50|서청주우체국|미배달  폐문부재\n(보관중)', '1102326110106|2024-09-05|12:36|서광주우체국|미배달  수취인불명\n(반송)', '1102326110107|2024-09-06|09:06|아산우체국|미배달  이사불명\n(반송)', '1102326110108|2024-09-09|10:04|경기광주우체국|미배달  폐문부재\n(보관중)', '1102326110109|2024-09-05|10:13|성남분당우체국|배달완료 (배달)\n (수령인:김**님 - 경비원)', '1102326110110|2024-09-05|10:08|포항장량동우체국|미배달  수취인불명\n(반송)', '1102326110111|2024-09-05|10:14|사천우체국|미배달  폐문부재\n(보관중)', '1102326110112|2024-09-05|11:13|서울광진우체국|미배달  폐문부재\n(보관중)', '1102326110113|2024-09-05|12:34|해운대우체국|미배달  수취인불명\n(반송)', '1102326110114|2024-09-06|13:08|대구성서우체국|미배달  폐문부재\n(보관중)', '1102326110115|2024-09-05|11:48|원주우체국|미배달  폐문부재\n(보관중)', '1102326110116|2024-09-05|11:16|남부산우체국|배달완료 (배달)\n (수령인:정**님 - 부모)', '1102326110117|2024-09-05|10:51|성남분당우체국|배달완료 (배달)\n (수령인:정**님 - 회사동료)']


print('\n'.join(request_list))